<template>
  <div class="p-4">
    <a-modal
      :visible="visible"
      :closable="false"
      :mask-closable="false"
      :confirm-loading="isConfirmLoading"
      :dialog-style="{ top: '20px' }"
      dialog-class="h-4/5"
      :body-style="{ height: '100%', overflowY: 'auto' }"
      :width="520"
    >
      <template slot="footer">
        <div :style="{ textAlign: 'right' }">
          <a-button
            type="primary"
            :disabled="!isAccept"
            @click="$emit('cancel', true)"
          >
            ยอมรับข้อตกลง
          </a-button>
          <a-button type="danger" @click="$emit('cancel', false)">
            ฉันยังกังวลเรื่องความปลอดภัยของข้อมูล
          </a-button>
        </div>
      </template>
      <div ref="container" class="scrollable-container">
        <a-affix :target="() => $refs.container">
          <div class="flex-1 ml-2">
            <div slot="cover" class="flex justify-center">
              <img
                slot="cover"
                class="mb-12 text-center"
                alt="example"
                src="ptt-digital-logo.png"
                width="300px"
              />
            </div>
            <div class="flex justify-center mb-3 text-base font-bold">
              ประกาศความเป็นส่วนตัวของผู้ใช้งานระบบ
            </div>
            <p class="text-sm">
              <span class="ml-10"></span>
              บริษัท พีทีที ดิจิตอล โซลูชั่น จำกัด (“บริษัท”)
              ให้ความสำคัญกับความเป็นส่วนตัวและมุ่งมั่นที่จะคุ้มครองข้อมูลส่วนบุคคลของท่าน
              (“ข้อมูลส่วนบุคคล”) ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.
              2562 (“พ.ร.บ.ฯ”) บริษัท
              จึงได้จัดทำประกาศความเป็นส่วนตัวฉบับนี้ขึ้น
              เพื่อแจ้งให้ท่านทราบถึงรายละเอียดเกี่ยวกับการเก็บ รวบรวม การใช้
              และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
            </p>
            <p class="text-base font-bold underline">
              1. วัตถุประสงค์ของการประมวลผลข้อมูลส่วนบุคคล
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>บริษัท จะเก็บรวบรวม ใช้
              และเปิดเผยข้อมูลส่วนบุคคลของท่านเฉพาะเมื่อมีเหตุผลที่เหมาะสมในการดำเนินการ
              และ/หรือ ที่กฎหมายกำหนดให้กระทำการได้
              ซึ่งรวมถึงการเปิดเผยข้อมูลส่วนบุคคลให้กับบุคคลภายนอกด้วย
              โดยมีวัตถุประสงค์หลัก ดังต่อไปนี้
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>1.1
              เพื่อการประมวลผลข้อมูลส่วนบุคคลของท่าน ในการปฏิบัติตามกฎหมาย
              หรือภาระข้อผูกพันตามกฎหมาย
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>1.2
              เพื่อประโยชน์อันชอบธรรมตามกฎหมายของบริษัท
              ที่จะประมวลผลข้อมูลส่วนบุคคลของท่าน
              โดยยังคงคำนึงถึงสิทธิขั้นพื้นฐานของท่านนั้นไม่เหนือไปกว่าประโยชน์ของบริษัท
            </p>
            <p class="text-base font-bold underline">
              2. ฐานในการประมวลผลข้อมูลส่วนบุคคล
            </p>
            <p class="text-sm">
              <span class="ml-10"></span
              >ในการดำเนินการเพื่อให้เป็นไปตามวัตถุประสงค์ บริษัท
              อาจประมวลผลข้อมูลส่วนบุคคลของท่านภายใต้กฎหมายที่เกี่ยวข้อง
              และฐานทางกฎหมาย โดยบริษัท
              ได้ประมวลผลข้อมูลส่วนบุคคลดังกล่าวโดยใช้ฐานทางกฎหมายดังต่อไปนี้
            </p>
            <table class="mb-5 tg">
              <thead>
                <tr>
                  <th class="tg-llyw" width="60%">
                    <p class="text-base font-bold">
                      วัตถุประสงค์ของการเก็บรวบรวม การใช้
                      และการเปิดเผยข้อมูลส่วนบุคคล
                    </p>
                  </th>
                  <th class="tg-llyw">
                    <p class="text-base font-bold">
                      ฐานในการประมวลผลข้อมูลส่วนบุคคล
                    </p>
                  </th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td class="tg-0pky" colspan="2">
                    <p class="text-base font-bold">
                      การบริหารความมั่นคง ความปลอดภัย และความเสี่ยง
                    </p>
                  </td>
                </tr>
                <tr>
                  <td class="tg-0pky">
                    <p class="text-sm">• เพื่อยืนยันตัวตนของท่าน</p>
                    <p class="text-sm">
                      • เพื่อป้องกันอาชญากรรม
                      และบริหารจัดการความปลอดภัยของบริษัท เช่น
                      ติดตั้งกล้องวงจรปิดภายใน และโดยรอบบริษัท
                      ซึ่งอาจมีการเก็บภาพ ภาพเคลื่อนไหว ภาพใบหน้าและเสียง
                      ของท่าน การแลกบัตรผ่านเข้าออกห้อง Data Center
                    </p>
                    <p class="text-sm">
                      • เพื่อปฏิบัติตามกฎหมาย และกฎระเบียบที่เกี่ยวข้อง
                    </p>
                  </td>
                  <td class="tg-0pky">
                    <p class="text-sm">• ฐานหน้าที่ตามกฎหมาย</p>
                    <p class="text-sm">• ฐานประโยชน์อันชอบธรรม</p>
                  </td>
                </tr>
              </tbody>
            </table>
            <p class="text-base font-bold underline">
              3. การเก็บรวบรวมข้อมูลส่วนบุคคล
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>บริษัท
              เก็บรวบรวมและใช้ข้อมูลส่วนบุคคลดังนี้
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>3.1 บริษัท
              เก็บรวบรวมข้อมูลส่วนบุคคลจากท่านโดยตรง
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>3.2 ประเภทของ
              <b>“ข้อมูลส่วนบุคคล”</b> ของท่านที่บริษัท เก็บรวบรวม ใช้
              หรือเปิดเผย (รวมเรียกว่า <b>“ประมวลผล”</b>)
              ภายใต้กฎหมายที่เกี่ยวข้อง
              รวมถึงแต่ไม่จำกัดเพียงข้อมูลส่วนบุคคลดังต่อไปนี้ <br /><span
                class="ml-14"
              ></span
              ><b>• ข้อมูลส่วนตัว:</b> ชื่อ นามสกุล หมายเลขบัตรประจำตัวประชาชน
              หมายเลขหนังสือเดินทาง ลายมือชื่อ ภาพถ่ายจากกล้องคอมพิวเตอร์
              ภาพหรือบันทีกจากกล้องวงจรปิด (CCTV) <br /><span
                class="ml-14"
              ></span
              ><b>• ข้อมูลการติดต่อ:</b> ชื่อบริษัท เบอร์โทรศัพท์ อีเมล์
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>3.3
              การปฏิเสธให้ข้อมูลส่วนบุคคลแก่บริษัท ในกรณีที่บริษัท
              จำเป็นต้องเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน
              และท่านไม่ให้ข้อมูลส่วนบุคคลของท่านแก่บริษัท บริษัท
              อาจปฏิเสธการติดต่อเยี่ยมชมของท่าน
            </p>
            <p class="text-base font-bold underline">
              4. การเปิดเผยข้อมูลส่วนบุคคล
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>บริษัท
              อาจเปิดเผยหรือส่งต่อข้อมูลส่วนบุคคลของท่านให้แก่บุคคลภายนอก
              เพื่อให้บุคคลเหล่านี้ประมวลผลข้อมูลส่วนบุคคลของท่าน ดังต่อไปนี้
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>4.1
              การเปิดเผยข้อมูลส่วนบุคคลให้แก่บุคคลอื่น <br /><span
                class="ml-14"
              ></span
              >• ผู้รับเหมาช่วง หรือผู้ให้บริการใด ๆ ที่ทำงานให้กับบริษัท
              หรือให้บริการแก่บริษัท ทั้งนี้รวมถึงผู้รับเหมาช่วง ผู้ให้บริการ
              ผู้บังคับบัญชา และผู้ปฏิบัติงานของบุคคลดังกล่าว <br /><span
                class="ml-14"
              ></span
              >• คนกลาง บุคคลผู้ติดต่อ และตัวแทนของท่าน <br /><span
                class="ml-14"
              ></span
              >• หน่วยงานที่บังคับใช้กฎหมาย รัฐบาล ศาล หน่วยงานระงับข้อพิพาท
              <br /><span class="ml-14"></span>•
              บุคคลอื่นใดซึ่งมีความเกี่ยวข้องกับข้อพิพาทใด ๆ ที่เกิดขึ้น
              <br /><span class="ml-14"></span>• บุคคลใด ๆ ที่บริษัท
              ได้รับคำสั่งจากท่านให้เปิดเผยข้อมูลส่วนบุคคลของท่านให้กับบุคคลดังกล่าว
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>4.2
              การส่งหรือโอนข้อมูลส่วนบุคคลไปยังต่างประเทศ บริษัท อาจต้องส่ง
              หรือโอนข้อมูลส่วนบุคคลของท่านไปยังต่างประเทศ เพื่อจัดเก็บ และ/หรือ
              ประมวลผลในการปฏิบัติตามสัญญาที่ทำขึ้นระหว่างท่าน และบริษัท
              โดยบริษัท
              จะไม่อนุญาตให้บุคคลที่ไม่เกี่ยวข้องเข้าถึงข้อมูลส่วนบุคคลดังกล่าว
              และจะกำหนดให้มีมาตรการรักษาความปลอดภัยที่เหมาะสม
            </p>
            <p class="text-base font-bold underline">
              5. การเก็บรักษาข้อมูลส่วนบุคคล
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>บริษัท
              จะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านไว้ตราบเท่าที่จำเป็น
              เพื่อให้บรรลุวัตถุประสงค์ในการเก็บรวบรวม และประมวลผลข้อมูลดังกล่าว
              โดยบริษัท จะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้เป็นระยะเวลา 1 ปี
              นับจากวันที่ท่านเข้าเยี่ยมบริษัท โดยบริษัท จะลบ ทำลาย
              หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลได้
              เว้นแต่ในกรณีที่มีเหตุจำเป็นทางกฎหมาย หรือเหตุผลทางเทคนิครองรับ
              บริษัท
              อาจเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้นานกว่าระยะเวลานานกว่านั้น
            </p>
            <p class="text-base font-bold underline">
              6. สิทธิของเจ้าของข้อมูลส่วนบุคคล
            </p>
            <p class="text-sm">
              <span class="ml-10"></span
              >ท่านมีสิทธิในข้อมูลส่วนบุคคลของท่านตามกฎหมายการคุ้มครองข้อมูลส่วนบุคคล
              โดยบริษัท จะเคารพสิทธิของท่านและจะดำเนินการตามกฎหมาย กฎเกณฑ์
              หรือกฎระเบียบที่เกี่ยวข้องกับการประมวลผลข้อมูลของท่านภายใต้สถานการณ์บางประการ
              อย่างทันท่วงที
            </p>
            <p class="text-sm">
              <span class="ml-10"></span
              >ท่านมีสิทธิดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของท่านดังต่อไปนี้
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>6.1
              <b>สิทธิในการขอเข้าถึงข้อมูลส่วนบุคคล:</b>
              ท่านมีสิทธิในการขอสำเนาข้อมูลส่วนบุคคลของท่านจากบริษัท
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>6.2
              <b>สิทธิในการขอแก้ไขข้อมูลส่วนบุคคล:</b>
              ท่านมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้อง เป็นปัจจุบัน
              และสมบูรณ์
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>6.3
              <b>สิทธิในการขอลบข้อมูลส่วนบุคคล:</b> ท่านมีสิทธิร้องขอให้บริษัท
              ลบ ทำลาย
              หรือทำให้ข้อมูลส่วนบุคคลของท่านไม่สามารถระบุตัวตนของท่านได้ในกรณีที่ไม่มีเหตุผลอันสมควรให้บริษัท
              ประมวลผลข้อมูลส่วนบุคคลของท่านต่อไป
              โดยท่านสามารถใช้สิทธิในการขอให้บริษัท
              ลบข้อมูลส่วนบุคคลนี้ควบคู่ไปกับสิทธิในการคัดค้านในข้อถัดไป
              อย่างไรก็ตาม
              การใช้สิทธินี้จะต้องไม่เป็นการใช้สิทธิเพื่อขอให้ลบข้อมูลส่วนบุคคลทั้งหมด
              โดยบริษัท
              จะพิจารณาแต่ละคำขอด้วยความระมัดระวังตามบทบัญญัติของกฎหมายที่เกี่ยวข้องกับการประมวลผลข้อมูลส่วนบุคคลของท่าน
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>6.4
              <b>สิทธิในการคัดค้าน:</b>
              ท่านมีสิทธิคัดค้านการประมวลผลข้อมูลส่วนบุคคลของท่านที่บริษัท
              ประมวลผลภายใต้ฐานผลประโยชน์อันชอบธรรมของบริษัท นอกจากนี้
              ท่านยังมีสิทธิคัดค้านการประมวลผลข้อมูลส่วนบุคคลของท่าน หากบริษัท
              ประมวลผลข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ทางการตลาด
              การบันทึกและวิเคราะห์ลักษณะทางจิตวิทยาและพฤติกรรมของบุคคล
              (Profiling)
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>6.5
              <b>สิทธิในการขอให้มีการระงับการประมวลผล:</b>
              ท่านมีสิทธิขอให้บริษัท
              ระงับการประมวลผลข้อมูลส่วนบุคคลของท่านชั่วคราว เช่น
              เมื่อท่านต้องการให้บริษัท แก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้อง
              หรือเมื่อท่านร้องขอให้บริษัท พิสูจน์เหตุผล
              หรือฐานทางกฎหมายในการประมวลผลข้อมูลส่วนบุคคลของท่าน
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>6.6
              <b>สิทธิในการยื่นข้อร้องเรียน:</b>
              ท่านมีสิทธิยื่นข้อร้องเรียนต่อหน่วยงานของรัฐที่เกี่ยวข้อง
              รวมไปถึงคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลในกรณีที่ท่านเห็นว่า
              บริษัท หรือพนักงานของบริษัท
              หรือผู้ให้บริการฝ่าฝืนหรือไม่ปฏิบัติตามพ.ร.บ.ฯ หรือประกาศอื่น ๆ
              ที่ออกโดยอาศัยอำนาจตามพ.ร.บ.ฯ ดังกล่าว
            </p>
            <p class="text-sm">
              <span class="ml-10"></span
              >ท่านอาจใช้สิทธิข้างต้นของท่านได้ตลอดเวลา โดยติดต่อบริษัท
              ผ่านทางช่องทางการติดต่อตามที่ระบุไว้ในข้อ 8 ด้านล่าง
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>บริษัท
              อาจมีความจำเป็นต้องขอข้อมูลบางประการจากท่านเพื่อใช้ในการยืนยันตัวตนของท่านและรับรองสิทธิของท่านในการเข้าถึงข้อมูลส่วนบุคคล
              (หรือเพื่อใช้สิทธิอื่นใด)
              เพื่อให้เป็นไปตามมาตรการความปลอดภัยที่จะทำให้ท่านมั่นใจได้ว่าข้อมูลส่วนบุคคลของท่านจะไม่ถูกเปิดเผยต่อบุคคลที่ไม่มีสิทธิเข้าถึงข้อมูลดังกล่าว
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>บริษัท
              จะใช้ความพยายามในการตอบกลับคำขอที่ถูกต้องตามกฎหมายทั้งหมดภายใน 30
              วัน ในบางกรณี บริษัท อาจใช้เวลามากกว่า 30
              วันหากคำขอของท่านมีความซับซ้อน
              หรือท่านยื่นคำขอเข้ามาเป็นจำนวนมากกว่าหนึ่งคำขอ ในกรณีดังกล่าว
              บริษัท
              จะแจ้งให้ท่านทราบและจะทำการแจ้งสถานะของคำขอให้ท่านทราบอยู่เสมอ
            </p>
            <p class="text-base font-bold underline">
              7. ความปลอดภัยของข้อมูลส่วนบุคคลของท่าน
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>บริษัท
              ให้ความสำคัญกับความปลอดภัยของข้อมูลส่วนบุคคลของท่านเป็นอย่างยิ่ง
              บริษัท จะตรวจสอบและใช้มาตรการรักษาความปลอดภัยขององค์กร
              ทั้งทางกายภาพ และทางเทคนิคที่เหมาะสมอยู่เสมอ
              ในการจัดเก็บและประมวลผลข้อมูลส่วนบุคคลของท่าน
              เพื่อให้มั่นใจว่าข้อมูลส่วนบุคคลของท่านจะไม่สูญหาย
              ถูกทำลายโดยไม่ตั้งใจ ถูกเปิดเผย และนำไปใช้ในทางที่ผิดวัตถุประสงค์
              หรือ
              เข้าถึงโดยบุคคลอื่นที่ไม่ใช่พนักงานหรือผู้ประมวลผลข้อมูลส่วนบุคคลที่ปฏิบัติหน้าที่ของบริษัท
            </p>
            <p class="text-base font-bold underline">
              8. การจัดการกับเรื่องร้องเรียน หรือข้อสงสัย
            </p>
            <p class="text-sm">
              <span class="ml-10"></span>ท่านสามารถติดต่อบริษัท
              เพื่อร้องเรียนเกี่ยวกับวิธีการที่บริษัท จัดเก็บ ใช้ ประมวลผล
              และเปิดเผยข้อมูลส่วนบุคคลของท่าน หรือสอบถามข้อสงสัยได้ที่ช่องทาง
              ดังต่อไปนี้
            </p>
            <p></p>
            <p class="text-sm">
              <span class="ml-10"></span
              ><b>บริษัท พีทีที ดิจิตอล โซลูชั่น จำกัด</b>
            </p>
            <p class="text-sm">
              <span class="ml-10"></span
              ><b>555/1 ศูนย์เอนเนอร์ยี่คอมเพล็กซ์ อาคารเอ ชั้น 4-5</b>
            </p>
            <p class="text-sm">
              <span class="ml-10"></span
              ><b>ถนนวิภาวดีรังสิต แขวงจตุจักร เขตจตุจักร กรุงเทพฯ 10900</b>
            </p>
            <p class="text-sm">
              <span class="ml-10"></span
              ><b>โทรศัพท์: 66 (0) 2140 2000 โทรสาร: 66 (0) 2140 2999</b>
            </p>
            <p class="text-sm">
              <span class="ml-10"></span><b>อีเมล: DPOs@pttdigital.com</b>
            </p>
            <p></p>
            <p></p>
            <div class="flex justify-end">
              <a-checkbox
                class="text-base font-bold text-blue-800"
                @change="onChange"
              >
                ยอมรับข้อตกลง
              </a-checkbox>
            </div>
          </div>
        </a-affix>
      </div>
    </a-modal>
  </div>
</template>

<script lang="ts">
import {
  ref,
  computed,
  defineComponent,
  useContext,
  watch,
} from '@nuxtjs/composition-api'
import moment from 'moment'
import { find } from 'lodash'

export default defineComponent({
  props: {
    visible: {
      type: Boolean,
      required: false,
    },
  },

  setup(_props, context) {
    const {
      $auth: { user },
    } = useContext()
    const isConfirmLoading = ref(false)
    const i18n = context.root.$i18n
    const locales = ref(i18n.locales)
    const currentLocale = computed(() => {
      return find(locales.value, (l: any) => l.code === i18n.locale)
    })
    const errorMessage = ref()
    const isAccept = ref(false)
    const isUser = ref(false)
    function onChange(e: any) {
      if (e.target.checked === true) {
        isAccept.value = true
      } else {
        isAccept.value = false
      }
    }

    // watch(
    //   () => props.guid,
    //   () => {
    //     if (
    //       props.guid !== '' &&
    //       props.guid != null &&
    //       props.guid !== 'undefined'
    //     ) {

    //     }
    //   }
    // )

    watch(
      () => user,
      (v) => {
        if (v?.id > 0) {
          isUser.value = true
        }
      },
      {
        immediate: true,
      }
    )

    return {
      moment,
      isConfirmLoading,
      currentLocale,
      errorMessage,
      isAccept,
      onChange,
      isUser,
    }
  },
})
</script>

<style type="text/css">
.tg {
  border-collapse: collapse;
  border-spacing: 0;
}
.tg td {
  border-color: black;
  border-style: solid;
  border-width: 1px;
  overflow: hidden;
  padding: 10px 5px;
  word-break: normal;
}
.tg th {
  border-color: black;
  border-style: solid;
  border-width: 1px;
  font-weight: normal;
  overflow: hidden;
  padding: 10px 5px;
  word-break: normal;
}
.tg .tg-llyw {
  background-color: #f2f3f4;
  border-color: inherit;
  text-align: left;
  vertical-align: top;
}
.tg .tg-0pky {
  border-color: inherit;
  text-align: left;
  vertical-align: top;
}

#components-affix-demo-target.scrollable-container {
  height: 100px;
  overflow-y: scroll;
}
#components-affix-demo-target .background {
  padding-top: 60px;
  height: 300px;
  background-image: url('https://zos.alipayobjects.com/rmsportal/RmjwQiJorKyobvI.jpg');
}
</style>
